// Variable name naming Convention and Best Practice.
// ও Variable তোর নাম দিবো কি??
// Variable এর নাম ডিক্লার করতে হলে আমাদের কিছু রুলস পালন করতে হবে
// জাভাস্ক্রিপ্ট এর রিসার্ভ কিওয়ার্ড ব্যবহার করা যাবেনা ভেরিয়েবল এর নাম হিবেবে।
// https://www.w3schools.com/js/js_reserved.asp
// ভেরিয়েবল এর নাম ডিক্লার করতে হলে ১টি শব্দে ডিক্লার করতে হবে।
// ভেরিয়েবল এর নামে আমরা কোটেশন ব্যবহার করতে পারবো না।
// ভেরিয়েবল নাম যদি অনেকগুলো শব্দে লিখতে হয় তবে স্পেস না দিয়ে একসাথে লাগিয়ে লিখবো আর ক্যামেল কেস ফরমেটে লিখবো। উদাহরণঃ
var myOfficeAddress = "Vuter Golir Chipa";