// Variable type, Numeric, String, Boolean.
// *** কিছু কিছু ভেরিয়েবল এর মান সংখ্যা হয় তাই সেই var এর type হবে Numeric। যেমনঃ
var price = 20;
console.log(typeof price);

// কিছু কিছু ভেরিয়েবল এর মান অনেকগুলো শব্দ দিয়ে হয় কাজেই সেগুলো আর নিউমেরিক ভেরিয়েবল এর মানের মতো লিখা যায় না। তা লিখতে হলে অবশ্যই আটকে দিতে হবে ঠিক দড়ি দিয়ে কোনো কিছু বেধে যেমন আটকে রাখা হয় ঠিক সেরকম। তো এখানে তো আর দড়ি দিয়ে আটকানো যাবে না এখানে আটকাতে হবে কোটেশন দিয়ে। উদাহরণঃ
var address = "Vuter Golir Chipa"
console.log(typeof address);
// আর এটা করলে দেখা যাবে এই ভেরিয়েবল এর টাইপ হচ্ছে String।

// একটু স্পেশাল দেখতে অনেকটা ‍String এর মতো হলেও এটিকে কোটেশন ছাড়াই লিখা হয়। আর এটা হচ্ছে true এবং false
var passKorsi = false;
console.log(typeof passKorsi);
// আর এটা করলে দেখা যাবে এই ভেরিয়েবল এর টাইপ হচ্ছে Boolean.