// Declare Array, array length and array index

// Array হচ্ছে প্রোগ্রামিং এর ক্ষেত্রে অনেকগুলো জিনিসের একসাথে কালেকশন। এটি ব্যবহারের ক্ষেত্রে বক্স ব্রাকেট ব্যবহার করতে হবে। যদি একটি ভ্যারিয়েবল এর মধ্যে অনেক গুলো ভ্যালু রাখতে হয় তখন ওই ভ্যারিয়েবলকে Array বলে সম্বোধন করতে হয়।
var friendsAge = [11, 13, 17]; // এটা ছিলো নিউমেরিক Array এর জন্য

var favouritePet = ["cat", "dog", "goat"]; // এটা ছিলো String Array এর জন্য

// কোনো Array এর মধ্যে কতগুলো ইলিমেন্ট আছে তা জানতে
console.log(favouritePet.length); // এতে করে প্রত্যেকটা Array এর মধ্যে কতগুলো ভ্যালু আছে তা দেখা যাবে।

// Array এর পজিশন বলে একটা জিনিস আছে। Array এর মধ্যে যদি অনেকগুলো ভ্যালু থাকে তাহলে সেই ভ্যালু গুলো কে শুন্য থেকে ১, ২ , ৩ করে পজিশন ধরা হয়। এগুলোকে Array এর ইনডেক্স বলা হয়
