function sum(i) {
    if (i == 1) {
        return 1;
    }
    return i + sum(i - 1);
    /* 
    আই এর মান এখন ৬ আসলে i + sum(i-1)--> 6 + sum(6-1) --> 6 + sum(5)
    আই এর মান এখন ৫ আসলে i + sum(i-1)--> 5 + sum(5-1) --> 5 + sum(4) --> 6+5+sum(4)
    আই এর মান এখন ৪ আসলে i + sum(i-1)--> 4 + sum(4-1) --> 4 + sum(3) --> 6+5+4+sum(3)
    আই এর মান এখন ৩ আসলে i + sum(i-1)--> 3 + sum(3-1) --> 3 + sum(2) --> 6+5+4+3+sum(2)
    আই এর মান এখন ২ আসলে i + sum(i-1)--> 2 + sum(2-1) --> 2 + sum(1) --> 6+5+4+3+2+sum(1)
    আই এর মান এখন ১ আসার কারণে উপরের শর্তের সাথে মিলে যায় তাই শর্তঅনুযায়ি sum(1) এর মান ১ রিটার্ন করবে। এখন হিসাব দাড়ালো 6+5+4+3+2+1=21 আর এটাই পাবো আমরা এই ফাংশন থেকে
    */
}

console.log(sum(6));